In [21]:
import pandas as pd  
titanic_train = pd.read_csv(r"C:\Users\V\Desktop\python_ineuron\organizations.csv")   
titanic_train

   Index  Organization Id            Name  Number of employees  years
0      1  FAB0d41d5b5d22c         Ferrell                 3498      2
1      2  6A7EdDEA9FaDC52        Mckinney                 4952      4
2      3  0bFED1ADAE4bcC1          Hester                 5287      5
3      4  2bFC1Be8a4ce42f  Holder-Sellers                  921      6
4      5  9eE8A6a4Eb96C24     Mayer Group                 7870     10
5      6  cC757116fe1C085  Henry-Thompson                 4914      5
6      7  219233e8aFF1BC3  Hansen-Everett                 7832      5
7      8  ccc93DCF81a31CD   Mcintosh-Mora                 4389      4
8      9  0B4F93aA06ED03e        Carr Inc                 8167      8
9     10  738b5aDe6B1C6A5      Gaines Inc                 9698     10

In [74]:
titanic_train.describe()

          Index  Number of employees      years
count  10.00000             10.00000  10.000000
mean    5.50000           5752.80000   5.900000
std     3.02765           2625.74378   2.643651
min     1.00000            921.00000   2.000000
25%     3.25000           4520.25000   4.250000
50%     5.50000           5119.50000   5.000000
75%     7.75000           7860.50000   7.500000
max    10.00000           9698.00000  10.000000

In [3]:
titanic_train.columns

Index(['Index', 'Organization Id', 'Name', 'Number of employees', 'years'], dtype='object')

In [5]:
titanic_train.dtypes
type(titanic_train.dtypes)

pandas.core.series.Series

In [8]:
dy = titanic_train.dtypes
dy[0:4]

Index                   int64
Organization Id        object
Name                   object
Number of employees     int64
dtype: object

In [59]:
import pandas as pd
import numpy as np
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}

df = pd.DataFrame(dict)
df
# for is null
df.isnull()
# filling missing values
# filling missing value using fillna()  

#  drop missing values using dropna() function  row wise 
df.dropna()

   First Score  Second Score  Third Score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [64]:
import pandas as pd
  
# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
 
# creating a dataframe from a dictionary 
df = pd.DataFrame(dict)

#iterating over rows using iterrows() function 
for i, j in df.iterrows():
    print(i, j)
    print()

# iterating over columns 
columns = list(df)
 
for i in columns:
    # printing the third element of the column
    print (df[i][2])

0 name      aparna
degree       MBA
score         90
Name: 0, dtype: object

1 name      pankaj
degree       BCA
score         40
Name: 1, dtype: object

2 name      sudhir
degree    M.Tech
score         80
Name: 2, dtype: object

3 name      Geeku
degree      MBA
score        98
Name: 3, dtype: object

sudhir
M.Tech
80

In [65]:
import pandas as pd
data = [1, 2, 3, 4] 
ser = pd.Series(data)
print(ser)

0    1
1    2
2    3
3    4
dtype: int64